Autodesk.Revit.DB.FabricationDimensionDefinition.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.FabricationDimensionDefinition.IsModifiable
If the fabrication dimension is modifiable by user.
Since:
2016

Autodesk.Revit.DB.FabricationDimensionDefinition.UnitType
Fabrication dimension unit type.
Since:
2016

Autodesk.Revit.DB.FabricationDimensionDefinition.Type
Fabrication dimension type.
Since:
2016

Autodesk.Revit.DB.FabricationDimensionDefinition.Name
Fabrication dimension name.
Since:
2016

Autodesk.Revit.DB.FabricationDimensionDefinition
Fabricaition dimension definition
Since:
2016